hw06/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @title = "All users"
    @users = User.paginate(page: params[:page])